[
    {
        "Date": "June 2024",
        "Rating": "10",
        "Title": "Never book with quanta’s again",
        "Review": "I’ll never book for quantas again .. I thought they r good in Australia that’s why it’s abit expensive and no… it’s ridiculous for us to wait at Launceston airport for seven hours with our four month old baby to go to Sydney .. no compensation for it absolutely ridiculous",
        "ExtraRating": {
            "Legroom": null,
            "In-flight Entertainment": null,
            "Value for Money": null,
            "Check-in and Boarding": null,
            "Seat Comfort": null,
            "Customer Service": null,
            "Cleanliness": null,
            "Food and Beverage": null
        }
    },
    {
        "Date": "April 2024",
        "Rating": "10",
        "Title": "Consistently unreliable",
        "Review": "Was booked Qantas Townsville to Cairns, then rest of flight was airnorth. Two hours before flight I received txt stating my Tsv CNS flight was cancelled & they'd send new flight details. They then booked me Tsv- Brisbane, brisbane,- Melbourne; melb to darwin. This is certainly not the first time I've had to go via this or similar route to what is normally a 2 .5 hour flight. You never know if or when your booked Qantas flights will eventuate. They are extremely unreliable.",
        "ExtraRating": {
            "Legroom": "10",
            "In-flight Entertainment": "10",
            "Value for Money": "10",
            "Check-in and Boarding": "20",
            "Seat Comfort": "20",
            "Customer Service": "10",
            "Cleanliness": "20",
            "Food and Beverage": "10"
        }
    },
    {
        "Date": "June 2024",
        "Rating": "10",
        "Title": "Poor Hotline Customer Service",
        "Review": "What happened was I booked my return flight from Singapore to Melbourne in Dec 2023. Just before flight in June 2024, there was change of aircraft type, which affected my selection of seat for both forward and return flights, which I paid for $40 per trip, so total $80.    No one from Qantas informed me about the change of fleet and hence, my seat booking became invalid. Qantas allocated my seat to other site, without any consultation and still charged me $80 for the seat selection.    Called the hotline and the customer service officer insisted that I booked the changed seats, without bothering to check and return call, even though I tried very hard to explain the situation. Before we could reach a resolution, she cut off my call abruptly. It was pure insult and poor, unprofessional customer service.",
        "ExtraRating": {
            "Legroom": "30",
            "In-flight Entertainment": "40",
            "Value for Money": "30",
            "Check-in and Boarding": "30",
            "Seat Comfort": "30",
            "Customer Service": "10",
            "Cleanliness": "30",
            "Food and Beverage": "40"
        }
    },
    {
        "Date": "June 2024",
        "Rating": "50",
        "Title": "THE BEST EXPERIENCE",
        "Review": "What can I say? I left Perth with my husband the 4th of June (noon) and EVERYTHING was absolutely perfect. On time, good food (with a vegetarian option), they offered us ice cream and tons of snacks. We landed safely in Singapore, ready for Dubai. Thanks Qantas",
        "ExtraRating": {
            "Legroom": "40",
            "In-flight Entertainment": "40",
            "Value for Money": "50",
            "Check-in and Boarding": "50",
            "Seat Comfort": "40",
            "Customer Service": "50",
            "Cleanliness": "40",
            "Food and Beverage": "40"
        }
    },
    {
        "Date": "June 2024",
        "Rating": "30",
        "Title": "Cramped in seat 9C",
        "Review": "Special thanks to service staff and crew for assisting my wife. Boeing 737, seats 9B & 9C, no window, cramped, first occasion in seven flight that there was insufficient room to lay the table flat, hence I had to forego the meal, although I did enjoy a glass of wine. Memo to passengers, you need to be no more than 80kg to enjoy a comfortable flight in these seats, not sure why there is no window adjacent 9A. Inflight service ok, my wife enjoyed her meal and drinks. Good communications from cabin crew and the cockpit during the flight. Experienced some turbulence but not major. Perth Airport needs to improve efficiency with unloading and delivery of luggage to the carousel.",
        "ExtraRating": {
            "Legroom": null,
            "In-flight Entertainment": null,
            "Value for Money": null,
            "Check-in and Boarding": null,
            "Seat Comfort": null,
            "Customer Service": null,
            "Cleanliness": null,
            "Food and Beverage": null
        }
    }
]